{"meta":{"exported_on":1408552443891,"version":"3.1.0"},"data":{"posts":[{"title":"Ciao mondo!!","slug":"2006-04-09-ciao-mondo-2","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"Da buon programmatore (non è vero che lo sono ma facciamo finta... :-)) quando si inizia ad imparare qualcosa di nuovo la prima cosa da fare è un bel: \\\"hello world!!\\\". Ed ecco qui il mio!\\n\\nSono ormai mesi che ho installato questo server e configurato il blog.. aspettavo solo l'occasione giusta per iniziare a scrivere. Bè, ora è arrivata! Non so se scriverò spesso, se scriverò ancora e nemmeno cosa scriverò, che tipo di blog sarà, se sarà. Come vedete le idee sono chiare fin dall'inizio!\\n\\nVi chiederete (non vi chiederete perché tanto non leggerà nessuno..) qual è l'occasione che mi ha spinto ad iniziare.. bè, rischiando di essere troppo filosofici e banali, vi dico che la vita riserva dei cambiamenti; cambiamenti che uno non si sarebbe mai aspettato che accadessero fin poco prima che questi si manifestino. Ecco, io ci sono appena passato attraverso ed ora è giunto il momento di ricominciare... da questo blog. O meglio: questi 2, 3, 100 post non faranno sicuramente la differenza su quello che potrà accadere ma mi aiuteranno a riflettere, cosa che a volte non ho fatto a sufficienza e che mi ha portato fin qui...\\n\\nE quindi: via, si parte... magari non stasera che ho sonno ;-); per il momento può bastare questa \\\"dichiarazione d'intenti\\\" (..iniziamo bene..)\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1144609539000,"created_at":1144609539000,"updated_at":1144609539000},{"title":"Paulo Coelho - Come il fiume che scorre","slug":"2006-04-10-come-il-fiume-che-scorre","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"Non mi è piaciuto molto... Forse più per la tipologia di libro (una collezione di brevi articoli) che non per i contenuti o per il modo in cui è scritto. Infatti devo dire che il libro si lascia leggere molto bene (l'ho finito in 3 giorni), la scrittura è lineare, chiara e diretta, mi piace.\\n\\nE' il primo libro che leggo di questo autore nonostante sia famosissimo e da tempo avrei voluto leggere qualcosa di suo; oltretutto l'ho iniziato a leggere per caso una sera a casa dei miei visto che non avevo portato il mio solito libro (o meglio, non era in programma che stessi lì a dormire..). Non sapevo cosa aspettarmi.. bè, forse è un po' troppo impermeato di religione per i miei gusti, dietro a tutti gli aneddoti e i racconti si sente la sua Fede e il suo attribuire ad un fine ultimo o ad un disegno \\\"superiore\\\" ogni avvenimento. A parte questo i racconti sono interessanti e offrono diversi spunti di riflessione; sono d'accordo con chi definisce Coelho come uno scrittore che parla più all'anima che alla mente, alcuni degl articoli soo veramente toccanti. Penso che valga la pena leggere qualcosa di questo autore, magari un romanzo invece di quesa \\\"collezione\\\".\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1144670621000,"created_at":1144670621000,"updated_at":1144670621000},{"title":"Jeffery Deaver - Il silenzio dei rapiti","slug":"2006-04-17-il-silenzio-dei-rapiti","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"Come avrete capito dalle mie precedenti letture, Deaver è uno dei miei autori preferiti e non si smentisce nemmeno in questo ultimo thriller! Ultimo solo in ordine di lettura perché è stato pubblicato nel lontano 2000; ha ancora la dicitura del prezzo nelle 2 valute: lira ed euro. :-)\\nLa storia è quella di tre carcerati evasi che, durante la loro fuga, sequestrano un pullman con a bordo 8 bambine sordomute e le loro insegnati rifugiandosi poi in un mattatoio abbandonato. Qui inizia l'estenuante trattativa per la liberazione degli ostaggi condotta, da un lato, da Handy, il capo dei malviventi (il più sadico e spietato) e, dall'altro, dall'agente Potter, specialista di sequestri. Il libro scorre molto veloce tra un colpo di scena e l'altro e vede pian piano nascere anche una storia d'amore tra l'agente ed una delle sequestrate che si rivela essere un inaspettato aiuto per i federali. Molto bella e accurata l'analisi psicologica dei personaggi che rende ancora più verosimile la trama.\\nDavvero un gran bel thriller come quelli a cui ci ha abituati Deaver, giocato sul filo del rasoio con un finale inaspettato.\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1145293597000,"created_at":1145293597000,"updated_at":1145293597000},{"title":"Jeffery Deaver - Profondo blu","slug":"2006-05-20-profondo-blu","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"Un altro libro di Deaver... prometto che questo è l'ultimo, per ora! :-)\\n\\nUn giovane hacker perde la cognizione del mondo reale. Come in un gioco online, si diverte, da perfetto social engeneer, a travestirsi per avvicinare le sue vittime ed ucciderle con un fendente al cuore. La squadra di poliziotti incaricata di catturarlo chiede aiuto ad un genio dei computer rinchiuso nelle prigioni di stato che però non si rivela essere quello che ci si aspettava.\\nIl romanzo è bello e pieno di colpi di scena anche se a volte un po' irreale... questo giudizio è probabilmente dato dal fatto che un po' mi intendo di computer e sicurezza e certi hack descritti nel romanzo mi fanno inorridire :-) come anche l'uso della terminologia informatica.\\nComunque la storia è scorrevole e intrigante... il giudizio è ancora una volta positivo per Deaver ;-)\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1148140795000,"created_at":1148140795000,"updated_at":1148140795000},{"title":"Il codice Da Vinci","slug":"2006-05-24-il-codice-da-vinci","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"Domenica sera sono andato a vedere con i compagni del Cefriel il film più atteso dell'anno (...): il Codice Da Vinci.\\n\\nStendiamo un velo pietoso sulle pubblicità pre-film e sulla campagna anti pirateria che è un oltraggio al decoro (se uno vede quel filmato non può far altro che correre a casa e iniziare a scaricare film per protesta).\\n\\nAndando al sodo.. premetto che ho letto il libro, che non sono propriamente religioso (anzi...) e che tutte le discussioni fatte da cattolici o meno su questo romanzo mi fanno solo ridere. Detto questo il film è stato meglio di come me lo aspettavo; probabilmente ero partito prevenuto avendo sentito da ogni parte delle critiche feroci che lo descrivevano come noioso e poco attinente al libro; forse, dopo lo scotto di \\\"L'acchiappasogni\\\", pensavo che anche questa trasposizione cinematografica fosse un modo come un altro per rovinare un bel thriller. Bè, mi sono dovuto ricredere.\\n\\nIl film non è noioso, anzi, ha un buon ritmo e non ci sono parti particolarmente lente. Ci sono alcune scene un po' cruente ma non si scade nel \\\"pulp\\\" e si sopportano benissimo (a meno di non essere particolarmente suscettibili, vero Laura?!? :-)). Oltretutto, a dispetto delle critiche e dei miei pregiudizi mi è parso rispecchiare bene la trama del libro: tutte le scene apparse nel film sono la riproduzione precisa di quel che descrive il romanzo. Ovviamente non si sono dovuti fare dei tagli e forse alcune parti non sono spiegate altrettanto bene come lo sono su carta, ma, tutto sommato, è stata una scelta azzeccata perché allungare ancora di più il film, che già dura 2 ore e 30, sarebbe stato davvero troppo.\\n\\nIn conclusione sono stato contento di aver speso questi 7 euri e 50 cents... unica nota negativa? Il cinema, di una scomodità tremenda, specialmente per un film così lungo... all'uscita sembravo il gobbo di Notre Dame da tanto ero accartocciato! (tutta colpa di Alessio che ci porta nel cinema sotto casa... :evil:)\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1148505919000,"created_at":1148505919000,"updated_at":1148505919000},{"title":"Dan Brown - La verità del ghiaccio","slug":"2006-05-27-la-verita-del-ghiaccio","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"E con questo è finita la trilogia di Dan Brown.. penso non siano usciti altri suoi libri in italia.\\n\\nLa storia in breve è quella di un gruppo di scienziati che viene convocato dal presidente degli Stati Uniti per avvalorare una scoperta fatta dalla NASA. Questi si trovano così coinvolti in un intrigo con al centro un ritrovamento che potrebbe cambiare tutte le credenze scientifice sull'inzio della vita sulla terra. A questo si aggiungono la corsa elettorale per la rielezione, le smanie politiche di un senatore senza scrupoli, la vendetta di un funzionario governativo per l aperdita della figlia, la lotta per la liberalizzazione del mercato della tecnologia spaziale e l'immancabile storia d'amore alla Dan Brown. :-)\\nDei tre thriller di questo autore \\\"la verità del ghiaccio\\\" è probabilmente quello che mi è piaciuto di meno. Non è un brutto libro, Dan Brown riesce comunque a tenere viva l'attenzione del lettore, ma non è incalzante, non crea la stessa smania di arrivare in fondo del \\\"codice\\\" o di \\\"angeli e demoni\\\". Le ambientazioni sono molto belle e per la prima volta l'autore parla di \\\"casa sua\\\" e non si lancia in strane descrizioni della storia o dell'arte europea, campate forse un po' per aria, come nei precedenti libri. Nonostante questo però la trama non mi convince molto: è un po' troppo semplice e lineare; già da metà libro si riesce a capire chi ha fatto cosa e perché... in un thriller che si rispetti non deve succedere :-). Probabilmente ciò che in relatà ha fatto la fortuna degli altri libri sono stati i temi particilarmente \\\"scottanti\\\", non so.\\n\\nNon voglio elevarmi a grande critico ma questa volta darei un bel pollice verso!\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1148730885000,"created_at":1148730885000,"updated_at":1148730885000},{"title":"Laurea!!!","slug":"2006-08-01-laurea","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"[![](https://codeandrun.it/content/images/import/alex_tesi.jpg)\\n\\nDottore... dottore... dottore del buco del .... :-D\\n\\nDopo anni e anni di permanenza al poli finalmente ce l'ho fatta: mi sono guadagnato la mia bottiglia di Berlucchi!! ;-)\\n\\nSi tira un sospiro di sollievo anche se, a ben vedere, sono solo passato sallo status di studente a quello di disuccupato... non un grande passo avanti da questo punto di vista!! Speriamo di guadagnare presto la qualifica di _lavoratore stipendiato_!!\\nUna giornata veramente bella anche se sotto un sole cocente (penso di non essere mai stato tanto _pezzato_ in vita mia :-)); devo ringraziare tutti gli amici che sono riusciti a venire e anche quelli che, per cause varie, non sono riusciti ma che avrebbero voluto farlo!\\n\\nA nessuno interesserà ma per chi volesse la mia tesi è reperibile [qui](tesilaurea.pdf) e [qui](presentazione.odp) invece si può trovare la relativa presentazione...\\n\\nChe dire ancora... su Flickr trovate le altre foto della laurea.\\n\\nSaluti dal Dott.Mag.Ing. *aLeX* 8)\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1154436427000,"created_at":1154436427000,"updated_at":1154436427000},{"title":"Di ritorno dalle vacanze","slug":"2006-08-26-di-ritorno-dalle-vacanze","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"Purtroppo anche quest'anno le vacanze sono finite; non che adesso io debba lavorare, sono ancora senza un'occupazione :-(, però l'essere lontani da casa, bè, è tutta un'altra cosa. Anche perché qui alla fine c'è sempre qualcosa da fare! ![](https://codeandrun.it/content/images/import/sardegna-121.jpg)\\nMa parliamo di queste ferie... bellissime!! Sono stato in sardegna, più precisamente sulla costa orientale, due settimane. La prima settimana è stata faticosa... ci siamo avventurati sul supramonte di baunei in trekking! Partendo da Santa Maria Navarrese, con una quindicina di chilometri e circa 800 metri di dislivello, siamo arrivati fino ad un ovile che è stato il nostro accampamento per i primi tre giorni. Da qui ogni giorno, camminando sempre per una decina di chilometri, si è raggiunta una cala diversa: Cala Goloritzè, Cala Mariolu fino ad arrivare a Cala Sisine dove abbiamo pernottato per il quarto giorno. Il giorno successivo ci siamo spostati verso Cala Luna pernottando anche lì all'interno di una grotta. Infine l'ultimo giorno (una tappa leggera.... vero Paolo?!?!) siamo arrivati alla nostra destinazione: Cala Gonone!!\\n\\nLa seconda settimana invece in campeggio a Tortolì: puro relax, condito da qualche escursione \\\"nuragica\\\" :-)\\n\\nHo fatto l'upload di qualche foto aspettando di avere quelle di tutti i compagni di avventura così potrò fare un resoconto migliore ;-)!!\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1156550165000,"created_at":1156550165000,"updated_at":1156550165000},{"title":"I miei primi 3000","slug":"2006-10-28-i-miei-primi-3000","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"Con un po' di ritardo eccomi a raccontarvi della mia \\\"impresa sportiva\\\": la salita sulla cima del monte Blinnenhorn (3374 metri), in val Formazza.\\n\\nLa comitiva (cinque persone: Io, Laura, Sara, Sara-2, Davide) è partita sabato mattina dal lago Morasco (1850 metri). Zaino in spalla abbiamo iniziato la salita;\\n\\n![](https://codeandrun.it/content/images/import/Blinnenhorn-010.jpg)\\n\\ndestinazione: rifugio Claudio e bruno, quota 2710 dove avremmo passato la notte. La salita, dopo uno strappo iniziale, non è stata particolarmente faticosa e, tra un avvistamento di marmotte e l'altro siamo arrivati fino al lago Sabbione dove abbiamo fatto una breve sosta mangereccia :-).\\n\\nRipresa la salita, dopo 3 ore circa di cammino, siamo giunti al rifugio giusto in tempo per fare qualche foto prima dei cena. Dopo l'abbondante polenta con spezzatino e il terrificante budino (che NESSUNO ha ancora capito cosa contenesse) siamo stati intrattenuti da alcuni simpatici signori che hanno rallegrato la nostra serata con le più varie canzoni: da \\\"bella ciao\\\" a \\\"il ragazzo della via gluch\\\", passando per Battisti e Modugno: un vero e proprio concerto! Finita la performance canora, tutti a letto in vista della levataccia del giorno dopo. Peccato che nessuno avesse fatto i conti con un simpatico topastro che nel bel mezzo della notte ha deciso di passeggiare allegramente nell'intercapedine tra le perline della nostra stanza gettando nel panico la povera Sara-2 che, giustamente, ha voluto condividere il suo terrore con tutti noi!!\\n\\n6:00 - sveglia, colazione e... pronti a partire per la rampa finale! La salita è più impegnativa del giorno precedente e si passa molto vicino al ghiacciaio; veramente spettacolare trovarsi lì in mezzo, tra montagne e neve!\\n\\n![](https://codeandrun.it/content/images/import/Blinnenhorn-030.jpg)\\n\\nL'ultimo tratto è davvero ripido e infatti il gruppo si allunga un po' ma alla fine tutti arriviamo in vetta!! \\n\\n![](https://codeandrun.it/content/images/import/blinnenhorn-095.jpg)\\n\\nUn panorama mozzafiato a 360°: montagne ovunque, ma noi siamo sulla più alta ;-)!! Giusto il tempo delle foto di rito e di sgranocchiare qualcosa che ci tuffiamo in discesa; ci aspetta un dislivello notevole: 1500 metri.\\n\\nGià un po' stanchi per la salita, la discesa sembra non finire mai. Scegliamo di non fare la stessa strada dell'andata e passiamo per il rifugio 3A dove ci fermiamo per un brave sosta. Ripartiamo e subito ci infiliamo in un canalone che si rivela in realtà parecchio insidioso con grossi ciottoli e fondo ghiacciato nel centro. Con non pochi patimenti arriviamo sul Piano dei camosci dove tiriamo un po' il fiato e facciamo riposare le ginocchia che ormai risentono un pochino dei 1000 metri di discesa passati. Ultimo sforzo ed eccoci in vista del lago Morasco e delle nostre auto! Alla fine siamo tutti (bè, tranne Davide, la \\\"guida\\\") stanchi ma contenti. Un giro davvero bello e poi... il primo 3000 non si scorda mai ;-)!!\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1162071442000,"created_at":1162071442000,"updated_at":1162071442000},{"title":"Simpy","slug":"2006-10-29-simpy","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"Come sempre in perfetto orario vi annuncio che, da ormai qualche settimana, è online la lacalizzazione in italiano di simpy. Vi chiederete perché questa dovrebbe essere una notizia degna di un post (visto che ne pubblico così pochi); bè, il motivo è presto detto: la traduzione è stata fatta da [Stefano Nurchi](http://www.casperize.com) e dal sottoscritto. Non è una novità tradurre qualcosa per la comunità Open Source (faccio parte del progetto [ILDP](http://www.pluto.it/ildp) da un po' anche se non ho tantissimo tempo da dedicarvi) però questa è la prima volta che il mio \\\"lavoro\\\" ha visibilità globale; prima le traduzioni di guide e howto su linux restavano confinate ad un pubblico sicuramente più ristretto.\\n\\nMi sento di dire che è stato fatto un bel lavoro anche se rimane ancora qualcosa da fare a causa della natura \\\"hard-coded\\\" di alcune parti dell'interfaccia. :-)\\n\\nProbabilmente molti di voi non sanno che cosa sia Simpy... è un sito di [Social Bookmarking](http://en.wikipedia.org/wiki/Social_bookmarking) come i più famosi [Digg](http://digg.com) e [del.icio.us](http://del.icio.us/). Questi siti permettono di salvare i propri bookmark, classificarli ed effettuare ricerche su di essi; in più è possibile ricercare tra i bookmark di tutta la comunità quelli simili o che trattano un argomento di nostro interesse e vedere quali sono i più \\\"linkati\\\" o i più cliccati. Non è da sottovalutare un'altra utilità fondamentale: permette di avere i propri bookmark sempre disponibili anche se si utilizzano browser diversi o non si è sul proprio pc; a questo proposito è molto utile la possibilità di avere un feed RSS contenente i propri link sempre aggiornato.\\n\\n<del datetime=\\\"2013-07-31T07:51:41+00:00\\\">Per chi volesse rischiare l'integrità del proprio pc (:-p) ho scritto un piccolissimo script python (non concluso, non testato, in alfa version, che probabilmente funziona solo sul mio pc) che, sfruttando le API di simpy, genera come output il contenuto del file bookmark.html da utilizzare con firefox. :-) Se qualcuno è così pazzo da utilizzarlo poi mi faccia sapere se funziona.</del>\\n\\n(purtroppo lo script è andato perduto in qualche migrazione dei webserver)\\n\\nN.B. fare un backup dei propri bookmark prima di eseguire lo script è da ritenersi obbligatorio soprattutto perché lo script non ha la pretesa di effettuare un'integrazione tra i link locali e quelli di simpy ma unicamente di creare i dati per un file html contenente i SOLI bookamrk provenienti da simpy.\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1162074894000,"created_at":1162074894000,"updated_at":1162074894000},{"title":"12 chilometri in amicizia","slug":"2007-04-22-12-chilometri-in-amicizia","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"Dopo un lungo periodo di assenza da questo blog, eccomi a raccontare la _camminata dell'amicizia 2007._\\n\\nCome ogni anno a Bosisio Parini (non preoccupatevi se non lo conoscete, non l'avevo mai sentito nemmeno io... :-) ) viene organizzata l'ormai famosa camminata dell'amicizia per raccogliere fondi in favore dell'associazione [La Nostra Famiglia](http://www.lanostrafamiglia.it/ \\\"La nostra famiglia\\\"). Come potevamo non partecipare?? Non me l'aspettavo proprio... una folla incredibile di persone!! Si parla di 30.000 partecipanti ed in effetti sembravano davvero tanti!\\n\\n![](https://codeandrun.it/content/images/import/15042007.jpg)\\n\\n\\nA parte la \\\"levataccia\\\" domenicale che non prendo mai di buon grado :-P é stata proprio una bella mattinata. Avendo preso alla lettera la denominazione \\\"camminata\\\" abbiamo percorso i 12 chilometri in poco meno di 3 ore ;-) (a dire il vero con qualche sosta a salutare parenti e conoscenti e con il tratto agiuntivo dalla partenza fin nei meandri di Rogeno a casa di Laura); il vincitore invece ha impiegato 40 minuti... ma non era una camminata???? Se ce l'avessero detto prima... :-P\\n\\n![](https://codeandrun.it/content/images/import/15042007003.jpg)\\n\\nCome vedete non eravamo particolarmente affaticati.. anzi, c'é stato pure tempo per fare qualche sfilata di moda con gli occhiali fashion!!\\n\\nL'anno prossimo si replica e ovviamente... tutti di corsa!!\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1177270067000,"created_at":1177270067000,"updated_at":1177270067000},{"title":"Pomeriggio sulla sponda ricca","slug":"2007-04-23-pomeriggio-sulla-sponda-ricca","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"Domenica pomeriggio siamo andati a fare un giro sulla sponda ovest; del Lago Maggiore ovviamente :-) . Dicono sia la sponda ricca ed in effetti, vedendo le mega ville, i parchi e le spiagge private, non stento a crederci. Devo proprio dire che sono dei bellissimi posti che, nonostante siano a due passi da casa mia, ho sempre visitato poco.\\n\\nSiamo partiti da Arona e abbiamo fatto una breve tappa, con salita, al [San Carlone](http://it.wikipedia.org/wiki/Colosso_di_San_Carlo_Borromeo \\\"San Carlone\\\"). Non ero mai arrivato prima d'ora fino in cima... bello, strano, un po' claustrofobico; vi metto una foto anche se non rende molto la sensazione di stare li' dentro (soprattutto il caldo con il sole in una statua di metallo nero!) ![](https://codeandrun.it/content/images/import/22042007003.jpg)\\nAbbiamo poi continuato la passeggiata lungo la strada che costeggia il lago fino a Stresa. Sulla costa ci sono delle ville veramente stupende, con parchi che in questo periodo hanno dei colori fantastici... dei posti davvero da favola; ma chissà quanto costa una casa lì?? Peccato non aver fatto nemmeno una foto... la macchina digitale scalcinata ha deciso di fare un po' i capricci :-(\\n\\nArrivati a destinazione, dopo un po' di fatica nel trovare posteggio, ci siamo persi nei vicoletti di Stresa; qui il turismo la fa davvero da padrone e tra vetrine super chic e turisti stranieri ci si sente un po' nella _\\\"Rimini\\\"_ del Lago.\\n\\nSoddisfatti del giretto in paese e del gelato sul lungo lago abbiamo infine ripreso la macchina e siamo andati fino ad Intra, questa volta lungo la provinciale, non troppo panoramica purtroppo; qui abbiamo preso il traghetto che ci ha riportato a casa con una bella vista sulla cara Laveno.\\n\\nProprio un bel giro che, sicuramente, si puo' riproporre altre volte con piu' tempo a disposizione, magari fermandosi a visitare [villa Taranto](http://www.villataranto.it \\\"Villa Taranto\\\") o [villa Pallavicino](http://www.parcozoopallavicino.it/ \\\"Villa Pallavicino\\\") .\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1177364328000,"created_at":1177364328000,"updated_at":1177364328000},{"title":"Google trascendentale","slug":"2007-04-24-google-trascendentale","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"Certo che gli americani sono proprio fuori di testa... Una cosa positiva c'é, se vogliamo ben vedere: almeno non si puo' accusare la [North Shore Assembly of God](http://www.northshoreag.org/) di poca modernità :-)\\n\\n![](https://codeandrun.it/content/images/import/http://static.blogo.it/downloadblog/GoogleGod.jpg)\\n\\nLetto su [downloadblog](http://www.downloadblog.it/post/3856/google-vs-dio)\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1177446893000,"created_at":1177446893000,"updated_at":1177446893000},{"title":"Aggiornare il BIOS con linux","slug":"2007-05-02-aggiornare-il-bios-con-linux","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"Oggi ho controllato il sito dell per vedere se erano presenti aggiornamenti per il software del mio portatile. Con mio grande stupore, per la prima volta da quando l'ho acquistato, ho trovato un aggiornamento con priorità _urgent _e per di più un aggiornamento del BIOS. Da vero _smanettone_ non ho resistito alla tentazione e mi sono subito lanciato nell'aggiornamento :-) .\\n\\nCome consueto, gli aggiornamenti per i BIOS dell (penso sia lo stesso anche per altre marche di pc) vengono rilasciati sotto forma di eseguibili.... windows :-( . Devo dire che é buffo se pensiamo che Dell ha preannunciato l'intenzione di rilasciare versioni dei propri pc con preinstallato Linux... ma lasciamo perdere.\\n\\n_Purtroppo_ ( $GhignoSatanico) sul mio portatile, ormai da tempo, non esiste la minima ombra di un sistema operativo di casa MS (tranne in virtual machine); mi sono dovuto quindi  ingenare per trovare una strada alternativa per l'upgrade.\\nNon avendo in casa nessun boot disk del caro vecchio dos con il quale far partire l'aggiornamento, ho provato a rendere boot-abile una chiavetta USB. Dopo un po' di tentativi andati a vuoto (é necessaria in ogni caso un'immagine di un dischetto DOS per poterla rendere boot-abile) ho abbandonato questa strada per percorrerne un'altra assai più facile ;-) .\\n\\n**Ingredienti**: una chiavetta usb nella quale é stato copiato il file di aggiornamento del BIOS; un cd di installazione di windows 98/Me (e chi non ne ha uno..).\\n\\n**Preparazione:** Far partire il cd di installazione con inserita la chiavetta USB e scegliere l'opzione \\\"Boot del computer con supporto cd-rom\\\". Al prompt DOS, per pura magia informatica, vedrete che il drive \\\"c:\\\" non é altro che la nostra fida chiavetta USB. Basta quindi lanciare il file eseguibile... et voilà, aggiornamento del BIOS in corso.\\n\\n;-)\\n\\nDopo tutto i cd di windows allora servono a qualcosa....oltre che a mantenere in piano la scrivania. 8-)\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1178141408000,"created_at":1178141408000,"updated_at":1178141408000},{"title":"The long tail","slug":"2007-05-05-the-long-tail","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"... <span class=\\\"sans\\\">[Why the Future of Business Is Selling Less of More](http://www.amazon.com/Long-Tail-Future-Business-Selling/dp/1401302378 \\\"The long tail\\\").\\n</span>\\n\\nMah; qualche mese fa, quando sono andato ad un incontro sulla tecnologia SOA (organizzato da M$, ebbene sì..), mi é stata offerta una copia del suddetto libro. Se devo essere sincero me ne ero anche dimenticato ma ieri me lo sono trovato nella cassetta della posta :-).\\n\\nSinceramente non ho ben capito la relazione e lo scopo di regalare un libro come questo hai partecipanti ad un seminario \\\"tecnico\\\" sulle architetture _service oriented_; magari leggendolo svelerò il mistero... vi farò sapere. ;-)\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1178366949000,"created_at":1178366949000,"updated_at":1178366949000},{"title":"E la Mery si sposaaaa....","slug":"2007-05-24-e-la-mery-si-sposaaaa","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"![](https://codeandrun.it/content/images/import/19052007002.jpg) :-) Un po' in ritardo, come sempre, ecco le immagini del matrimonio della _nostra_ Mery!\\n\\nTutti presenti, tranne gli impossibilitati per cause di forza maggiore (leggi \\\"ballerine brasiliane\\\" :-) ), tutti eleganti e tutti pronti a ricoprire gli sposi di riso... non avranno davvero pensato che ci saremmo accontentati di quei coni microscopici con dentro 3 chicchi!! Per fortuna hanno rimediato all'incresciosa situazione Teo e Fabio: 3 Kg di riso (di cui 1 versato direttamente nel coppino della sposa) sono stati un'ottima soluzione! ;-)\\n\\n\\nOra il Davidino pensa di avercela portata via ma é tutta una facciata :-), ormai é una di noi...... ha pure bevuto lo spumante sui gradini della chiesa... non c'é più speranza: grandissima Mery!!\\n\\n![](https://codeandrun.it/content/images/import/19052007007.jpg)\\n\\nA parte gli scherzi, tantissimi auguri alla Santa Donna e al Davidino!!\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1180037843000,"created_at":1180037843000,"updated_at":1180037843000},{"title":"Migrazione ADSL","slug":"2007-06-02-migrazion-adsl","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"Ebbene si', dopo mille peripezie il mio rapporto conflittuale con Tele2 è finalmente chiuso. Ora non resta che aspettare il momento in cui mamma Telecom si deciderà a ridarmi la mia amata portante.... dicono metà settmana prossima, speriamo!\\n\\nPer il momento: viva il semiterno 56K!! ;-)\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1180794674000,"created_at":1180794674000,"updated_at":1180794674000},{"title":"Arcobaleno","slug":"2007-06-19-arcobaleno","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"Un paio di settimane fa (apprezzate come sempre la solerzia nello scrivere..) abbiamo concluso il nostro giro del Lago Maggiore. Dopo la [prima parte](https://alexmufatti.it/2007/04/23/pomeriggio-sulla-sponda-ricca/) fatta il mese scorso abbiamo proseguito con la seconda tappa: partenza da Intra e prima parte del percorso lungo la parte alta del lago, sponda piemontese.\\n\\nAbbiamo raggiunto Cannero e quindi Cannobio dove ci siamo fermati per una tappa, purtroppo l'unica, del nostro viaggio; durante la passeggiata per il paese, mentre mangiavamo un meritato gelato, siamo rimasti colpiti da quanto poco siano valorizzati alcuni luoghi di questi territori che, a nostro avviso, potrebbero avere un grosso fascino turistico. Un esempio sono i [castelli di Cannero](http://www.castellidicannero.com/ \\\"castelli di cannero\\\"): nonostante la bellezza del posto non si trova nemmeno un piccolo posteggio dove potersi fermare per ammirare il paesaggio o fare una foto.. mah.\\n\\nProseguendo abbiamo sconfinato in svizzera e siamo giunti fino a Brissago, Ascona e, infine, Locarno dove é iniziato il viaggio di ritorno verso casa sulla sponda lombarda.\\n\\n\\n![](https://codeandrun.it/content/images/import/03062007013.jpg)\\n\\nArrivati a Luino abbiamo trovato uno stupendo [arcobaleno](http://www3.varesenews.it/varese/articolo.php?id=74141 \\\"Arcobaleno\\\") a salutare il nostro ritorno :-).\\n\\nUn altro bel pomeriggio per la serie: \\\"_la riscoperta delle bellezze del lago Maggiore_\\\" :-D\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1182287629000,"created_at":1182287629000,"updated_at":1182287629000},{"title":"Il trenino delle Centovalli","slug":"2007-07-17-il-trenino-delle-centovalli","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"Questo weekend gita oltre confine per i nostri eroi :-) .Partenza verso le 9 da Sesto Calende; direzione: Domodossola. Li' il punto d'incontro con tutti i partecipanti, come al solito provenienti dai capi del mondo conosciuto :wink: .\\n\\nEd eccoli pronti a partire: Alex, Laura, Alessio, Graziano, Ale e Anna.\\n\\nIl piano, ambizioso, prevede la salita col trenino panoramico \\\"[Vigezzina-Centovalli](http://www.centovalli.ch/ \\\"Centovalli\\\")\\\" fino alla stazione di Camedo (per la precisione svizzera meglio dire Càmedo). Da lì discesa in **mountan bike** fino a Ponte Brolla (o Grolla, come dice il gra :-) ) dove riprendere il treno per Locarno; a questo punto non resta che l'ultimo tratto: Aliscafo per Stresa dove le fide FS li avrebbero riportati alle proprie dimore... sani e salvi.\\n\\nMa andiamo con calme: avevamo lasciato i nostri eroi a Domodossola dove, dopo essersi riuniti, ed aver conquistato l'agognato biglietto (brutte storie di prenotazioni fallite...) si imbarcano sul modernissimo trenino panoramico delle 11.42.\\n\\nMentre il treno si inerpica sulle montagne, tra un tornante e l'altro (dove d'inverno viene utilizzata per alcuni tratti anche una cremagliera per consentire la salita) i nostri amici trovano il tempo di scattare qualche foto...\\n\\nUn po' abbattuti gli impavidi viaggiatori bivaccano nel parchetto della stazione aspettando che apra il noleggio delle biciclette ma soprattutto aspettando buone notizie dalle nuvole nere all'orizzonte. Nel frattempo c'é sempre spazio per la fregatura della giornata (fortunatamente piccola): un caffé da 1.5 euri nell'unico bar dell'intera vallata probabilmente...Giunti alla prima tappa, Camedo, la situazione non é delle migliori: il tempo (come già pre-gufato da Alessio) non da segni rassicuranti e, anczi, inizia anche a cadere qualche goccia; la stazione é deserta, probabilmente sono gli unici ad avere avuto questa bell'idea. Che fare??\\n\\nEd ecco che finalmente il noleggiatore di velocipedi arriva. Gli sofrtunati viaggiatori chiedono ragguagli sul tempo e lui li rassicura dicendo che non sono previsti temporali per la giornata ma conclude con una frase a dir poco infelice :\\\"Deh, anche l'anno scorso ho consigliato ad un gruppo di scendere nonostante il tempo non fosse dei migliori... mi hanno poi chiamato da Valle dicendomi che avevano preso una gran lavata...\\\"; e in quel momento inizia a pivere....\\n\\n[gallery]\\n\\nRincuorati dalle sagge parole e con un po' di sana incoscienza i biker partono a cavallo dei mezzi (in perfette condizioni) durante la prima spiovuta. La discesa molto divertente, la strada abbastanza larga, i panorami sempre bellissimi e il tempo che sembra tenereconvincono i nostri discesisti di aver fatto la scelta giusta. I più veloci ( non si fanno nomi .. :cool: ) hanno tempo anche per soffermarsi a fotografare gli scorci e gli altri membri del gruppone...\\n\\nI nostri stupefatti gitanti riprendono dunque il treninio (in quresto tratto quasi una metropolitana) diretto a [Locarno](http://www.locarno.ch \\\"Locarno\\\") dove, con un certo anticipo, riescono a prenotarsi per la corsa in Aliscafo (la gentilissima signora del chiosco dice che sono gli ultimi 6 posti disponibili... ma sull'aliscafo in realtà ci sono un sacco di posti liberi). Una breve passeggiata sul lungo lago (giusto il tempo per ammirare un altro nome di quelli che si possono trovare solo altralpe: il gelato \\\"**pirulo**\\\"!! :shock: ) a via, a cavalcare le onde verso Stresa dove li attende la chiusura del cerchio: il treno verso casa!Arrivati in fondo alla discesa i nostri amici depositano le bici nell'apposito vagone merci; queste cose possono davvero succedere solo in svizzera, nessuno controlla chi lascia o chi prende, tutto é affidato unicamente alla correttezza degli utilizzatori: davvero complimenti, un esempioi di civiltà..\\n\\nProprio bello questo giro, una commistione di generi: treno, bici, aliscafo, lago, montagna, città... i nostri protagonisti sono stanchi ma soddisfatti e felici si dirigono verso il tramonto... su un treno delle FS..\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1184706639000,"created_at":1184706639000,"updated_at":1184706639000},{"title":"Back from the Bucks","slug":"2007-09-09-back-from-the-bucks","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"Sembra quasi che sappia l'inglese :wink: !\\n\\nSono appena tornato dall'Inghilterra dove ho accompagnato, e purtroppo lasciato, [la mia bella](http://www.laurafrigerio.it) che si tratterà ben sei mesi per lavoro/ricerca.\\n\\nLo scopo primario di questa  prima visita nel [Buckinghamshire](http://en.wikipedia.org/wiki/Buckinghamshire) non era quello di fare una vacanza e infatti non abbiamo avuto tempo per girare, se non in lungo e in largo per [High Wycombe](http://en.wikipedia.org/wiki/High_Wycombe) in cerca di casa. Missione, fortunatamente, compiuta... sembra con un buon risultato :-P .\\n\\nOra l'obiettivo é trovare un modo di raggiungere quei luoghi nel minor tempo e con la minor spesa possibile... ci sono un sacco di offerte, é vero, ma sincronizzare lavoro, aerei, bus, treni, non é per nulla un impresa facile! (se qualcuno ha esperienza o consigli... :oops: )\\n\\nSpriamo bene e nel frattempo [Skype](http://www.skype.com) ci sarà amico!\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1189349903000,"created_at":1189349903000,"updated_at":1189349903000},{"title":"La mia nuova tazza...","slug":"2008-01-09-la-mia-nuova-tazza","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"![](https://codeandrun.it/content/images/import/060420081.jpg?w=225&amp;h=300)!\\n\\nOk, la foto non le rende giustizia ma é bella vero?? :-)\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1199836726000,"created_at":1199836726000,"updated_at":1199836726000},{"title":"Invidia","slug":"2008-07-13-invidia","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"Ho letto qualche giorno fa del nuovo video di Matt Harding (quello di \\\"[Where the hell is Matt](http://www.wherethehellismatt.com)\\\") e ne ho approfittato per rivedere il primo video. Eccolo..\\n\\n[youtube bNF_P281Uu4]\\n\\nLeggendo il suo sito si scopre che, a differenza di quanto pensavo, Matt non viaggia per lavoro, anzi, non ha quasi un lavoro. E' solo abile a viaggiare spendendo il meno possibile e arrangiandosi alla bene e megio. E' strano come il primo pensiero che mi è venuto in mente vedendo il video sia stato: \\\"Ma che lavoro può fare uno casì..?\\\".\\n\\nHo sentito proprio oggi, in una replica di \\\"Friends\\\", una frase che si addice perfettamente al caso: \\\"...io non so vivere senza sapere quando e dove prenderò il prossimo stipendio...\\\". Probabilmente é proprio questa la paura che limita la maggior parte di noi (me in primis) ad essere inchiodata ad un posto, ad una casa, ad un lavoro. Si puo' dire che sbaglia e che ha ragione? Mah, probabilmente si potrebbero trovare eguali pregi, difetti e giustificazioni per entrambe le situazioni; so solo che quando lo vedo in tutti quei posti fantastici, senza vincoli, senza progetti mi fa una grande invidia..\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1215974930000,"created_at":1215974930000,"updated_at":1215974930000},{"title":"Storage USB e mount point","slug":"2008-09-13-storage-usb-e-mount-point","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"**Problema:** come tutti ormai vivo con quantità abnormi di dati memorizzate su dispositivi usb esterni. Come fare per avere questi dati sempre a disposizione sullo stesso \\\"mount point\\\" in linux? ![](https://codeandrun.it/content/images/import/harddisk1.jpg)\\n\\n**Soluzione:** ci sono 2 possibilità; la prima é quella di editare i files di regole di udev (ormai tutte le distribuzioni lo utilizzano) in modo da identificare il dispositivo hardware e assegnargli cosi' un nome unico all'interno dello pseudo filesystem \\\"dev\\\". Una volta ottenuto questo non resta che inserire in fstab la riga corretta per il montaggio del filesystem. Non é nulla di particolarmente complicato ma, come dicevo, c'é un'altra soluzione che é ancora piu' semplice.\\nQuasi tutte le distribuzioni moderne hanno abilitata la funzione di automount dei dispositivi usb; bene, il punto di mount utilizzato in maniera predefinita é la \\\"label\\\" del filesystem che deve essere montato (se presente). Quindi l'unica cosa da fare se volete avere un mount point fisso per il vostro filesystem non é altro che impostare una label a vostro piacimento per tutti i dispositivi usb, quando li collegherete ve li troverete montati automaticamente in `/media/&lt;label&gt;`. Una guida su come impostare la label per i tutti i filesystem linux la trovate [qui.](https://help.ubuntu.com/community/RenameUSBDrive \\\"guide\\\")\\nInoltre, se avete necessità di impostare delle opzioni di mount avanzate, potete utilizzare in ogni caso il file fstab prendendo come device `/dev/disk/by-label/&lt;label&gt;` e forzare il punto di mount o le opzioni come meglio credete.\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1221304451000,"created_at":1221304451000,"updated_at":1221304451000},{"title":"Le armi nascoste di Vim","slug":"2008-09-14-le-armi-nascoste-di-vim","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"![](https://codeandrun.it/content/images/import/vim-editor_logo.png?w=300) Certo che non si finisce mai di imparare... dopo quasi 10 anni di utilizzo scopro solo oggi che [Vim](http://www.vim.org) può editare direttamente file anche via ftp, scp, rcp!!\\n\\n`vim ftp://user@server/directory/file`\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1221417793000,"created_at":1221417793000,"updated_at":1221417793000},{"title":"Fifty people one question","slug":"2008-10-31-fifty-people-one-question","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"[vimeo 1737450]\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1225492049000,"created_at":1225492049000,"updated_at":1225492049000},{"title":"Trovare ed eliminare record (semi-)duplicati in SQL","slug":"2009-09-22-trovare-ed-eliminare-record-semi-duplicati-in-sql","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"Lo ammetto: non é certo la cosa più complicata del mondo eliminare le righe duplicate in un database; quando serve però non viene mai in mente un modo per farlo.\\nQuesto post lo categorizzo quindi come mio _promemoria_!\\n\\nPerché (semi-)duplicati?\\nParto dall'esempio pratico: aggiungere una chiave ad una tabella già piena di dati.\\nOvviamente, per la [legge di Murphy](http://it.wikipedia.org/wiki/Legge_di_Murphy), i valori dei campi che dovrebbero diventare chiave non saranno mai tutti diversi. Voglio quindi eliminare dalla tabella i record con chiavi uguali, preservandone solo una copia per ognuno.\\n\\nPoniamo che la nostra tabella di chiami table1 con campi field1,field2,field3 (la fantasia nel dare i nomi é il mio forte). Vogliamo far diventare field1 e field2 chiave primaria. Per eliminare i duplicati eseguiamo:\\n\\n`SELECT *\\nFROM db.table1 as t2\\nWHERE (t2.field1,t2.field2,t2.field3) not in (\\nSELECT t1.field1,t1.field2, min(t1.field3)\\nFROM db.table1 as t1\\ngroup by t1.field1,t1.field2)\\n`\\n\\nFatto! Come preannunciato niente di emozionante... ;-)\\n\\nOvviamente la regola `min(t1.field3)` puo' essere cambiata a piacimento per conservare il record piu' conveniente ai fini dell'applicazione.\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1253636707000,"created_at":1253636707000,"updated_at":1253636707000},{"title":"Cartello stradale a Lecco...","slug":"2009-12-08-cartello-stradale-a-lecco","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"Certo che se ne vedono di cose strane…\\n\\n![](https://codeandrun.it/content/images/import/051220091.jpg?w=300&amp;h=225)!\\n\\nEd io che pensavo che certe cose le facessero solo gli ingegneri! :-)\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1260269512000,"created_at":1260269512000,"updated_at":1260269512000},{"title":"WCF ServiceHost e Cross Domain Policy","slug":"2010-11-08-wcf-servicehost-e-cross-domain-policy","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"A volte capita di dover accedere con un'applicazione web a servizi hostati in un dominio esterno. Questo si risolve nella maggioranza dei casi impostando in maniera corretta il file `[clientaccesspolicy.xml](http://msdn.microsoft.com/en-us/library/cc197955(VS.95).aspx \\\"clientaccesspolicy\\\"). `\\n\\nNel caso in cui però il Web Service in questione non sia hostato da un vero e proprio web server ma da un'applicazione .NET (sia essa console o form) si deve ovviare al problema della Cross Domain Policy in manera più _fantasiosa_ ((poi dicono che gli informatici non hanno fantasia :-) )) .\\n\\n_<!--more-->_Quello che sto per descrivere é un modo semplice per _simulare_ la presenza del file `clientaccesspolicy.xml` quando si ha a che fare con un ServiceHost.\\n\\nSupponendo di avere già il Web Service funzionante (`MyService`), quello che resta da fare é far implementare ad esso un'interfaccia del tipo:\\n```csharp\\n[ServiceContract]\\npublic interface IPolicyRetriever\\n{\\n    [OperationContract]\\n    [WebGet(UriTemplate = \\\"/clientaccesspolicy.xml\\\")]\\n    Stream GetSilverlightPolicy();\\n}\\n```\\nInquesta interfaccia specifichiamo che il servizio deve rispondere quando viene interrogato l'Uri `/clientaccesspolicy.xml`.\\n\\nIl gioco è fatto.\\n\\nBasta ora implementare il service in un modo simile a questo:\\n```csharp\\npublic Stream GetSilverlightPolicy()\\n{\\n       string result = @\\n\\n                              \\\";\\n      WebOperationContext.Current.OutgoingResponse.ContentType = \\\"application/xml\\\";\\n      return new MemoryStream(Encoding.UTF8.GetBytes(result));\\n}\\n```\\ne creare il ServiceHost dove aggiungere i due endpoint.\\n```csharp\\nclass Program\\n    {\\n        static void Main(string[] args)\\n        {\\n            Uri baseAddress = new Uri(\\\"http://localhost:9090\\\");\\n            // Create the ServiceHost.\\n            using (ServiceHost host = new ServiceHost(typeof(MyService), baseAddress))\\n            {\\n                // Enable metadata publishing.\\n                ServiceMetadataBehavior smb = new ServiceMetadataBehavior();\\n                smb.HttpGetEnabled = true;\\n                smb.MetadataExporter.PolicyVersion = PolicyVersion.Policy15;\\n                host.Description.Behaviors.Add(smb);\\n                host.AddServiceEndpoint(typeof(IMyService), new BasicHttpBinding(), new Uri(\\\"http://localhost:9090/myservice.svc\\\"));\\n\\n                host.AddServiceEndpoint(typeof(IPolicyRetriever), new WebHttpBinding(), \\\"\\\").Behaviors.Add(new WebHttpBehavior());\\n\\n                host.Open();\\n                Console.ReadLine();\\n                host.Close();\\n            }\\n        }\\n    }\\n```\\nEcco fatto; il nostro client potrà accedere al WebService senza problemi.\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1289249689000,"created_at":1289249689000,"updated_at":1289249689000},{"title":"Siesta","slug":"2010-11-12-siesta","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"![](https://codeandrun.it/content/images/import/20101112-0416331.jpg)!\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1289575077000,"created_at":1289575077000,"updated_at":1289575077000},{"title":"Tale padrone...","slug":"2010-11-13-tale-padrone","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"![](https://codeandrun.it/content/images/import/20101113-0745131.jpg)!\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1289674267000,"created_at":1289674267000,"updated_at":1289674267000},{"title":"Che affetto","slug":"2010-11-14-che-affetto","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"![](https://codeandrun.it/content/images/import/20101114-0224181.jpg)!\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1289741236000,"created_at":1289741236000,"updated_at":1289741236000},{"title":"IIS errore 0x8ffe2740","slug":"2010-11-15-iis-errore-0x8ffe2740","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"Questo errore si verifica se la porta sulla quale si sta cercando di far girare un _Web Site_ é già in uso (Skype, Visual Studio, etc.). Ci voleva così tanto a scriverlo?\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1289840976000,"created_at":1289840976000,"updated_at":1289840976000},{"title":"Silverlight e Windows Login","slug":"2010-11-17-silverlight-e-windows-login","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"In Sirverlight non esiste nativamente il modo per ottenere le informazioni sull'utente connesso a Windows. Quello che si può fare é utilizzare del codice ASP lato server e poi recuperare le informazioni da Silverlight.\\n\\n<!--more-->\\nNel nostro container ASP che host il controllo Silverlight aggiungiamo qualcosa del tipo:\\n```csharp\\n\\n....\\n\\n    void Page_Load()\\n    {\\n      this.UsernameField.Value = User.Identity.Name;\\n    }\\n\\n  ...\\n```\\n\\nNel body invece mettiamo un controllo nascosto per contenere i nostri dati:\\n\\n```csharp\\n\\n  ...\\n\\n  ...\\n\\n```\\n\\nLato Silverlight leggiamo, quando ci occorre, il volore del tag _input_:\\n\\n```csharp\\npublic string GetUser()\\n{\\n  HtmlDocument doc = HtmlPage.Document;\\n  if (doc == null)\\n  {\\n    return string.Empty;\\n  }\\n  HtmlElement elm = doc.GetElementById(\\\"UserField\\\");\\n  if (elm == null)\\n  {\\n    return string.Empty;\\n  }\\n  return elm.GetAttribute(\\\"value\\\");\\n}\\n```\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1290020442000,"created_at":1290020442000,"updated_at":1290020442000},{"title":"'NetworkManager: openvpn secrets error'","slug":"2011-02-14-networkmanager-openvpn-secrets-error","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"<div>Today I tried to set up my openvpn connection through [NetwokManger](http://projects.gnome.org/NetworkManager/) (for instance, I'm using Ubuntu 10.10).</div>\\n<div>I imported my ovpn files (perfectly working on windows) with the NM gui without errors. Then, when I started the vpn, I got the error message: \\\"No valid secrets\\\"!</div>\\n<!--more-->\\n<div>Looking at syslog file i found this error line:</div>\\n` [1297693509.445619] [nm-vpn-connection.c:844] connection_need_secrets_cb(): NeedSecrets failed: dbus-glib-error-quark Rejected send message, 1 matched rules; type=\\\"method_call\\\", sender=\\\":1.4\\\" (uid=0 pid=1129 comm=\\\"NetworkManager) interface=\\\"org.freedesktop.NetworkManager.VPN.Plugin\\\" member=\\\"NeedSecrets\\\" error name=\\\"(unset)\\\" requested_reply=0 destination=\\\"org.freedesktop.NetworkManager.openvpn\\\" (uid=0 pid=8646 comm=\\\"/usr/lib/network-manager-openvpn/nm-openvpn-servic\\\"))`\\n<div>What you have to do to solve this issue is to edit your _/etc/dbus-1/system.d/nm-openvpn-service.conf_ and add these lines inside the busconfig tag:</div>\\n<div><del>`&lt;policy user=\\\"at_console\\\"&gt; &lt;allow own=\\\"org.freedesktop.NetworkManager.vpnc\\\"/&gt; &lt;allow send_destination=\\\"org.freedesktop.NetworkManager.openvpn\\\"/&gt; &lt;/policy&gt;`</del> (Thanks to Mauro for the correction)</div>\\n<div>\\n\\n`&lt;policy user=\\\"at_console\\\"&gt; &lt;allow own=\\\"org.freedesktop.NetworkManager.openvpn\\\"/&gt; &lt;allow send_destination=\\\"org.freedesktop.NetworkManager.openvpn\\\"/&gt; &lt;/policy&gt;`\\n\\n</div>\\n<div>I think that the same problem can be found in other NM's plugins like pptp or vpnc and can be resolved in the same way editing the corresponding .conf file.</div>\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1297704027000,"created_at":1297704027000,"updated_at":1297704027000},{"title":"Circolare Brinzio","slug":"2011-08-24-circolare-brinzio","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"[Garmin Connect](http://connect.garmin.com/activity/109105901).\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1314210077000,"created_at":1314210077000,"updated_at":1314210077000},{"title":"Debootstrap","slug":"2012-02-17-debootstrap","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"![](https://codeandrun.it/content/images/import/http://www.techspot.com/images2/downloads/topdownload/2015/01/debian.png)\\n\\nQuesto post é un piccolo howto su come installare Debian (o distro derivate come ubuntu) con debootstrap.\\n\\n<!--more-->\\n\\n### Nota importante\\n\\nLo scopo principale di questo post é spiegare il funzionamento di debootstrap e tenere degli appunti sulle fasi principali per l'installazione, non quello di fare un cut&amp;paste diretto dei comandi.\\n\\n### Assunzioni\\n\\nIn questo post si assume che:\\n\\n*   il disco sia già stato partizionato nella maniera corretta;\\n*   si stia installando debian sid;\\n*   la partizione di root é `/dev/sda1`;\\n*   la partizione /home `/dev/sda5`;\\n*   la partizione di swap é `/dev/sda2`.\\n\\n### Preparare il sistema live\\n\\nPer prima cosa occorre avere un media boot-abile di una distribuzione debian-based (ubuntu, mint, debian...etc). Facciamo il boot con il sistema live e accediamo alla console o, se si preferisce l'interfaccia grafica, ad un emulatore di terminale.\\n\\nProbabilmente l'installazione live non contiene debootstrap. Lo si può installare con:\\n`sudo apt-get install debootstrap`.\\n\\n### Preparare le partizioni\\n\\nSe il disco non é partizionato o si vuole cambiarne la suddivisione si può usare fdisk. Il mio disco solitamente é già partizionato e, soprattutto, nella partizione /home ci sono tutti i miei dati. Se questa é anche la vostra condizione occorre stare *molto* attenti a formattare unicamente la partizione root e non quella home. Il comando da eseguire é:\\n`sudo mkfs.ext3 /dev/sda1`.\\n\\nOra creiamo una directory sotto /mnt che sarà la base dell'installazione:\\n`sudo mkdir /mnt/new_install`\\nSuccessivamente montiamo lì i nostri filesystem:\\n`sudo mount /dev/sda1 /mnt/new_install`. (si potrebbe montare già da ora anche la directory /home ma per evitare cancellazioni accidentali meglio farlo dopo)\\n\\n### Eseguire debootstrap\\n\\nOk, si é pronti finalmente a lanciare debootsrap:\\n`sudo debootstrap --verbose --arch=amd64 sid /mnt/new_install`.\\nPer fare questo dovrete essere connessi ad internet. Una volta eseguito il comando si dovrà aspettare lo scaricamento e l'installazione del sistema base.\\n\\nOra, se tutto é andato per il verso giusto, dovremmo avere in /mnt/new_install la struttura base del fileystem e possiamo dunque procedere con il mount dei filesystem di sistema:\\n\\n*   proc: `sudo mount -t proc /proc /mnt/new_install/proc`\\n*   sysfs: `sudo mount -t sysfs /sys /mnt/new_install/sysfs`\\n*   dev: `sudo mount --bind /dev /mnt/new_install/dev`\\nInoltre creiamo un file che servità durante l'installazione del bootloader:\\n`touch /mnt/new_install/etc/mtab`\\n\\nInfine copiamo il file con i dns di sistema nella nuova installazione:\\n`sudo cp -a /etc/resolv.conf /mnt/new_install/etc/resolv.conf`\\n\\n### Chrooting\\n\\nPossiamo ora fare chroot nella nuova installazione:\\n`sudo chroot /mnt/new_install /bin/bash`\\n\\nDa questo momento in poi saremo all'interno della nuova installazione.\\nPer prima cosa, prima che ci si dimentichi e si debba rifare tutto da capo, impostiamo la password di root del sistema:\\n`passwd`\\n\\nDopodiché installiamo qualche pacchetto fondamentale con apt-get o aptitude:\\n\\n*   linux-image\\n*   grub\\n*   vim :-)\\nNel mio caso ora é il momento di montare il filesystem /home con:\\n`sudo mount /dev/sda5 /mnt/new_install/home`\\ne, se si vuole partire da un configurazione pulita per il proprio utente, spostare la vecchia home_dir:\\n`sudo mv /mnt/new_install/home/user /mnt/new_install/home/user_old`\\n\\nUltimo passo da non dimenticare, pena un kernel panic al primo avvio, creare il file /etc/ contenente:\\n\\n`proc /proc proc nodev,noexec,nosuid 0 0\\n/dev/sda1 / ext3 errors=remount-ro 0 1\\n/dev/sda5 /home ext3 defaults,user_xattr 0 2\\n/dev/sda2 none swap sw 0 0`\\n\\nOra é possibile uscire dal chroot e fare il reboot del sistema.\\nUna volta fatto il boot nel sistema base si può partire con l'installazione di tutti i pacchetti (xorg, etc) e con la creazione degli utenti.\\n\\nFinito, la nostra disto é installata!\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1329434453000,"created_at":1329434453000,"updated_at":1329434453000},{"title":"VPN selector","slug":"2012-02-18-vpn-selector","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"![](https://codeandrun.it/content/images/import/https://remibergsma.files.wordpress.com/2015/02/openvpn.png?w=580)Un piccolo script utile per gestire piú connessioni VPN.\\nLo script Python non fa altro che cercare tutti i file ovpn nelle sotto directory della directory passata come parametro (Documents/OpenVPN é la scelta di default).\\nPer il momento non é molto testato ma sembra funzionare ;-)\\n\\nLo trovate [qui](https://github.com/alexmufatti/Scripts/tree/master/scripts \\\"Scripts\\\").\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1329520639000,"created_at":1329520639000,"updated_at":1329520639000},{"title":"Pizzoni","slug":"2012-02-28-pizzoni","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"[Garmin connect](http://connect.garmin.com/activity/153341393 \\\"Garmin connect\\\")\\n\\n![](https://codeandrun.it/content/images/import/panorama1.jpg?w=300)\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1330410093000,"created_at":1330410093000,"updated_at":1330410093000},{"title":"Sant'Antonio","slug":"2012-03-28-santantonio","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"{{< instagram IuP7N0ioHM >}}\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1332945380000,"created_at":1332945380000,"updated_at":1332945380000},{"title":"Arcumeggia","slug":"2012-03-31-arcumeggia","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"{{< instagram I1Y-4VCoCM >}}\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1333184684000,"created_at":1333184684000,"updated_at":1333184684000},{"title":"Picuz","slug":"2012-03-31-picuz","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"{{< instagram I1ZD1rioCN >}}\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1333184689000,"created_at":1333184689000,"updated_at":1333184689000},{"title":"Cuvignone","slug":"2012-04-02-cuvignone","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"{{< instagram I7KFzZioLe >}}\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1333378211000,"created_at":1333378211000,"updated_at":1333378211000},{"title":"'Postazione #b'","slug":"2012-04-05-postazione-b-3","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"{{< instagram JCMr2iioFi >}}\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1333613946000,"created_at":1333613946000,"updated_at":1333613946000},{"title":"San Martino","slug":"2012-04-05-san-martino","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"### [San Martino](http://connect.garmin.com/activity/164994556)\\n\\nVía [Garmin Connect - alexmufatti](http://connect.garmin.com/explore?owner=alexmufatti)\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1333660928000,"created_at":1333660928000,"updated_at":1333660928000},{"title":"'San Martino in culmine #b'","slug":"2012-04-05-san-michele-in-culmine-b","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"{{< instagram J1vjy-CoPK >}}\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1333657943000,"created_at":1333657943000,"updated_at":1333657943000},{"title":"'Cloudy lake #b'","slug":"2012-04-12-cloudy-lake-b","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"{{< instagram JUxmNnCoPE >}}\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1334244720000,"created_at":1334244720000,"updated_at":1334244720000},{"title":"'My colleague! #cat #b'","slug":"2012-04-13-my-colleague-cat-b","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"{{< instagram JXf1SVCoKF >}}\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1334336532000,"created_at":1334336532000,"updated_at":1334336532000},{"title":"Vararo - Monteggia","slug":"2012-04-13-vararo-monteggia","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"## \\n[Vararo - Monteggia](http://connect.garmin.com/activity/167324458)\\n\\nVía [Garmin Connect - alexmufatti](http://connect.garmin.com/explore?owner=alexmufatti)\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1334281917000,"created_at":1334281917000,"updated_at":1334281917000},{"title":"'Cornizzolo #b'","slug":"2012-04-21-cornizzolo-b","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"{{< instagram JsF1ZwioGI >}}\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1335027730000,"created_at":1335027730000,"updated_at":1335027730000},{"title":"Rogeno - Cornizzolo - Terz'alpe - Rogeno","slug":"2012-04-22-rogeno-cornizzolo-terazalpe-rogeno","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"Questo weekend giro fuori provincia. Approfittando di una gita lecchese, decido di provare una delle poche salite che conosco nei dintorni.\\n\\nParto da Rogeno e, evitando di passare per le strade più trafficate, vado verso Cesana Brianza. Una volta arrivato, proseguo verso Pusiano e svolto a destra al semaforo, verso Eupilio. La strada prosegue in leggera salita e porta fino alle sponde del lago del Segrino. Da lì, tenendo la destra (la strada é comunque ben indicata), inizio la vera e propria salita del Cornizzolo.\\n\\n<!--more-->\\n\\nLe pendenze sono subito impegnative e non tendono mai a diminuire. Incontro tanta gente lungo la strada, il posto è molto frequentato ed essendo un soleggiato sabato, il traffico (pedoni e bici) è anche superiore al solito.\\n\\nProseguendo lungo la salita nel bosco arrivo fino ad un posteggio in corrispondenza di alcuni edifici dopo il quale la strada non è più percorribile in auto. A sancire il divieto c'è una sbarra che si deve scavalcare per proseguire.\\n\\nFinalmente esco dal bosco ed inizio gli ultimi chilometri di salita circondato dai prati e da una bellissima vista sui laghi di Annone e Lecco.\\n\\nPoco dopo costeggio il campo di lancio dei parapendii che è affollatissimo. Manca ancora un po' di strada e la pendenza non accenna ancora a diminuire, per di più la strada non è più a tornanti come nella prima parte ma dritta e non lascia respiro.\\n\\nArrivo finalmente al passo e, dopo una breve discesa, al rifugio: sono arrivato! Da qui si può salire fino al crocione; il sentiero però è in fortissima pendenza; probabilmente è percorribile quasi interamente in sella ma non voglio esagerare visto che mi manca ancora un bel po' di strada prima di tornare a casa!\\n\\n\\nVisto che non conosco i sentieri della zona, chiedo informazioni al rifugio. Mi dicono che le discese sulla parte sud del monte non sono percorribili in MTB. Lo è invece un sentiero che passa dalla Terz'Alpe e scende poi a Canzo. Decido di provarci e mi metto in marcia.\\n\\nDal rifugio percorro alcune centinaia di metri prima di trovare il bivio sulla sinistra che porta all'imbocco del sentiero. L'inizio della discesa, come mi avevano spiegato, non è percorribile in sella anzi... alcuni punti sono particolarmente impegnativi da fare anche con la bici in spalla. Il tutto è reso ancora più complicato dal fondo viscido per le piogge dei giorni precedenti.\\n\\nIncontro un bivio inaspettato e non segnato. Per fortuna il cellulare prende e controllo sulla cartina, la direzione giusta è sinistra. Arrivati alla Terz'Alpe la strada migliora molto e posso scendere in sella senza problemi. Il fondo è ciottolato e non ci sono particolari ostacoli se non i_ __soliti_ canali di scolo che mi fanno prendere qualche botta.\\n\\nDopo una bella discesa si arriva a Canzo. Purtroppo non conosco bene la zona e devo seguire la strada principale per tornare al punto di partenza: trafficata e in alcuni punti stretta.\\n\\nSicuramente un bel giro, con una salita molto impegnativa e una discesa, purtroppo, rovinata dalla prima parte che è davvero difficile e obbliga scendere parecchie volte dalla bici.\\n\\n## [Rogeno - Cornizzolo - Terz'alpe - Rogeno](http://connect.garmin.com/activity/170244697)\\n\\nVía [Garmin Connect - alexmufatti](http://connect.garmin.com/explore?owner=alexmufatti)\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1335048687000,"created_at":1335048687000,"updated_at":1335048687000},{"title":"San Michele","slug":"2012-04-25-san-michele","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"{{< instagram J1vjy-CoPK >}}\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1335359827000,"created_at":1335359827000,"updated_at":1335359827000},{"title":"Vararo - Cuvignone - Sant'Antonio - San Michele - Muceno","slug":"2012-04-25-vararo-cuvignone-santantonio-san-michele-muceno","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"Primo giro della stagione con doppio gran premio della montagna :) .\\n\\nParto da Cittiglio e salgo fino a Vararo e da lì contino verso il passo del Cuvignone. Incontro vari ciclisti e un corridore lungo la via, mattina piutosto trafficata. Con sorpresa, arrivato in cima, trovo ancora un po' della neve caduta una paio di giorni fa nonostante sia Aprile inoltrato; ne approfitto per far fare i primi metri sulla neve alla nuova MTB ;-).\\n\\n<!--more-->\\n\\nDopo una breve pausa inizio la discesa verso Sant'Antonio. La strada é abbastanza innevata e bisogna stare attenti a non scivolare. Passo dalla chiesetta già visitata poco tempo fa e svolto verso Arcumeggia senza fermarmi. Subito dopo prendo il bivio sulla sinistra per San Michele.\\n\\nLa salita per l'alpe non è troppo impegnativa: senza strappi ma tutta all'ombra che con queste temperature non è il massimo. Nonostante il Cuvignone nelle gambe, salgo abbastanza bene. Arrivato al passo San Michele trovo il bivio per il Monte Colonna, magari proverò quel sentiero in una prossima uscita.\\n\\nDopo aver scollinato si arriva alla frazione di San Michele dove si trova il ristoro e la chiesetta la cui vista sul lago é però coperta dalla troppa vegetazione, peccato.\\n\\n![](https://codeandrun.it/content/images/import/img_02311.jpg) Chiesetta di San Michele!\\n\\nConsultando la cartina che si trova poco sotto la chiesa scopro dove inizia il sentiero per Brissago/Muceno; basta proseguire pochi metri sulla strada asfaltata, ignorando i cartelli per il sentiero _pedonale_ e lo si trova sulla sinistra ben indicato. La prima parte del sentiero é in leggera salita ma il fondo è compatto e salgo con facilità. Passo vicino all'eliporto e poi, sempre in salita, arrivo alla _balconata,_ attrezzata con area pic-nic e griglia da dove di gode di una bella vista sul lago.\\n\\n![](https://codeandrun.it/content/images/import/IMG_0235.jpg) Balconata San Michele!\\n\\nDa qui, tutta discesa fino a Muceno, facendo attenzione a tenere la sinistra al bivio con il sentiero per Brissago. La strada é ciottolata e percorribile senza problemi anche in salita. Il fondo é bagnato e viscido a causa delle piogge e della neve  ma poco sconnesso.\\n\\nArrivati a Muceno mi aspettano ancora poco meno di 15 chilometri per arrivare al punto di partenza e adesso la fatica un po' si fa sentire.\\n\\nUltima sorpresa, la strada che collega Laveno a Cittiglio é chiusa ma, pur di non fare qualche centinaio di metri in più, scavalco le barriere e proseguo dritto!\\n\\nUn ottimo giro, impegnativo (alla fine i metri di dislivello sono più di 1300 con 40 chilometri di sviluppo) ma soddisfacente. Facendolo si notano alcuni sentieri tra il passo del Cuvignone e l'alpe San Michele che dalla strada entrano nel bosco; sembrano percorribili anche in MTB e sarebbe interessante fare una ricognizione ;-).\\n\\n[gallery]\\n\\n## [Vararo - Cuvignone - Sant'Antonio - San Michele - Muceno](http://connect.garmin.com/activity/171633228)\\n\\nVía [Garmin Connect - alexmufatti](http://connect.garmin.com/explore?owner=alexmufatti)\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1335371898000,"created_at":1335371898000,"updated_at":1335371898000},{"title":"Automattic’s Worldwide WP 5k","slug":"2012-04-27-599","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"I'll sure join this event!!\\nI will cycle for 5k (I can't run because of a sprained ankle) giving my contribution from northern Italy!!\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1335520597000,"created_at":1335520597000,"updated_at":1335520597000},{"title":"Five stars madness","slug":"2012-04-27-five-stars-madness","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"Today I was looking, like almost every day, to iTunes top 25 apps when I found a nice free app with a great 5 star score and more than ten thousands reviews. I decided it was worth a try and download it immediately.\\n\\n![](https://codeandrun.it/content/images/import/capture.png)\\n\\n<!--more-->\\n\\nWhen the download finished I started it and, in a few minutes, I  found that it was not as good as expected, rather it had many limitations caused by the fact that it was the free app and not the paid one.\\n\\nIt really sounded very strange to me that so many people rated it 5 stars but suddenly I discovered the reason for such behavior: the app give you some free content as gift if you rate it 5 stars!! All became clear.\\n\\nI always relay on ratings and reviews of iTunes apps and the trend I'm seeing in these last months is warring me. The apps that give you contents or benefits if you give them great reviews are increasing; I hope Apple will take some measure to limit the misbehavior of these developers so that users can really trust in AppStore ratings above all for payed apps!!\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1335549610000,"created_at":1335549610000,"updated_at":1335549610000},{"title":"'Picuz #b #bike'","slug":"2012-04-28-picuz-b-bike","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"{{< instagram J9XAsyCoJS >}}\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1335606478000,"created_at":1335606478000,"updated_at":1335606478000},{"title":"San Clemente","slug":"2012-04-28-san-clemente","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"Breve escursione a San Clemente.\\n\\nPer variare un po' il solito percorso decido di salire dalla cava di Caravate. Prima faccio però tappa alla chiesetta dei frati che è lungo la strada, appena prima dell'inizio del sentiero.\\n\\n![](https://codeandrun.it/content/images/import/img_02381.jpg)\\n\\n<!--more-->\\n\\nAppena lasciata la chiesetta mi avventuro nel bosco. Non ricordo bene la strada ma fortunatamente non ci sono diramazioni particolari. La salita è inizialmente facile ma poi abbastanza impegnativa, soprattutto per via del fondo ghiaioso con molti sassi smossi.\\n\\n![](https://codeandrun.it/content/images/import/img_02441.jpg)\\n\\nScendendo alcune volte dalla sella riesco ad arrivare fino alla Balconata Picuz dalla quale si gode davvero di una bella vista!!\\n\\n![](https://codeandrun.it/content/images/import/img_0240.jpg)\\n\\nDecido di non salire fino al paesello ma di avventurarmi in discesa per un percorso mai fatto prima. Il sentiero è divertente e ben tenuto, ci sono parecchie diramazioni; di volta in volta scelgo la via che mi pare più percorribile.\\n\\nQuando sono ormai a valle uno di questi bivi mi porta in un sentiero cieco e devo farmi largo tra rami e rovi per ritornare su una traccia battuta.\\n\\n![](https://codeandrun.it/content/images/import/img_0247.jpg)\\n\\nSan Clemente riserva sempre delle novità. Sia la salita che la discesa che ho fatto in questo percorso non li avevo mai percorsi e, a giudicare da tutti i bivi che ho incontrato, penso che passerà ancora un bel po' di tempo prima che possa dire di aver provato tutte le varianti!\\n\\n[gallery]\\n\\n## [San Clemente](http://connect.garmin.com/activity/172413577 \\\"San Clemente\\\")\\n\\nVía [Garmin Connect - alexmufatti](http://connect.garmin.com/explore?owner=alexmufatti)\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1335625102000,"created_at":1335625102000,"updated_at":1335625102000},{"title":"Silverlight datagrid RowDetails Scrollbar Issue","slug":"2012-04-28-silverlight-datagrid-rowdetails-scrollbar-issue","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"While developing a customer application in Silverlight 4, we find a bug in the standard datagrid control of the framework.\\n\\nIf you have a custom datagrid _RowDetailsTemplate_ and this is opened and closed by a button click, you can see that, when opening the last visible row in your datagrid, the RowDetails  remains hidden, or partially hidden because the grid does not scroll automatically down to fully reveal it.\\n\\n![](https://codeandrun.it/content/images/import/capture1.png)\\n\\n<!--more-->\\n\\nThe only work-around I've found to avoid this misbehavior is to add the _RowDetailsVisibilityChanged_ event to the grid and do the following:\\n\\n\\n```csharp\\ndouble _rowheight = 0;\\nprivate void MyGrid_RowDetailsVisibilityChanged(object sender, DataGridRowDetailsEventArgs e)\\n{\\nif (e.Row.DetailsVisibility == System.Windows.Visibility.Visible)\\n{\\n_rowheight = e.Row.ActualHeight;\\ne.Row.Height = e.DetailsElement.DesiredSize.Height + _rowheight;\\nMyGrid.Dispatcher.BeginInvoke(delegate\\n{\\nMyGrid.Focus();\\nMyGrid.UpdateLayout();\\nMyGrid.SelectedItem = e.Row.DataContext;\\nMyGrid.CurrentColumn = SettingGrid.Columns[0];\\nMyGrid.ScrollIntoView(MyGrid.SelectedItem, MyGrid.Columns[0]);\\n});\\n}\\nelse\\n{\\ne.Row.Height = _rowheight;\\nMyGrid.Dispatcher.BeginInvoke(delegate\\n{\\nMyGrid.Focus();\\nMyGrid.UpdateLayout();\\n});\\n}\\n}\\n```\\n\\n\\nAs you can see the trick is to expand the grid row so that its height is equals to the height of the row details. Doing so you can than call the method _ScrollIntoView_ to reveal the whole row details.\\nWhen the row details is closed, you have to restore the original row height.\\n\\nA simple trick to fix one of the countless bugs in silverlight framework :-? !\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1335607730000,"created_at":1335607730000,"updated_at":1335607730000},{"title":"Automattic’s Worldwide WP 5k","slug":"2012-04-29-automattics-worldwide-wp-5k","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"So, here we are. Me and my wife went for the _Automattic's Worldwide WP 5k_ 2012 from lake _Maggiore _in northern Italy_!!_\\n\\nHere is what we have seen at the end of the 5 kilometers (then we continued for a while, also because we have to came back home :-P )\\n\\n![](https://codeandrun.it/content/images/import/img_02481.jpg)\\n\\n### \\n\\n![](https://codeandrun.it/content/images/import/img_02491.jpg)\\n\\nAnd here is the GPS track!\\n\\n## [Laveno Cerro](http://connect.garmin.com/activity/172503706)\\n\\nVía [Garmin Connect - alexmufatti](http://connect.garmin.com/explore?owner=alexmufatti)\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1335715817000,"created_at":1335715817000,"updated_at":1335715817000},{"title":"Sublime Text","slug":"2012-05-01-sublime-text","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"I've created a new category on this blog: _My Choices_. Here I'll talk about software, tech.. anything I use and I think It's worth a try. I don't want to give a full description or review but just few tips, pros and cons.\\n\\nLet's start with a text editor/IDE.\\n\\n## [Sublime Text 2](http://www.sublimetext.com/2 \\\"Sublime Text 2\\\")\\n\\n![](https://codeandrun.it/content/images/import/https://cdn.tutsplus.com/net/uploads/legacy/1140_st2plugins/200u.jpg)\\n\\nI'm always looking for a good text editor that can help me working on simple text files but also on small projects (typically javascript or python). I loved _vim_ (ok, vim is a religion, non an editor ;-) and I continue using it but when I want something of user-friendly it's not really a good choice.\\n\\nI start using [PSPad](http://www.pspad.com/), then I switch to [Notepad++](http://notepad-plus-plus.org/), then to [UltraEdit](http://www.ultraedit.com/). Each of these has many features and can be considered a great editor but I think this choice (the editor is one of my most used software) is also a matter of taste.\\n\\nWhat I want is:\\n\\n*   a light but good looking user interface;\\n*   cross platform (I switch frequently from windows to linux and maybe in future Mac OS);\\n*   programmability (not too complicated, just scripting of executing bat/sh);\\n*   column selection;\\n*   colour highlighting and formatting for source code;\\n*   single file/projects management;\\nAfter trying for some time Sublime Text 2, I can say it satisfy all these needs. It is one of the fastest editors I've tried out, with a light and interference free UI, it's cross-platform and has a great community of developers that creates plug-ins and themes for any needs.\\n\\nIt's definitely my choice! :-D\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1335885339000,"created_at":1335885339000,"updated_at":1335885339000},{"title":"'Vararo #b'","slug":"2012-05-01-vararo-b","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"{{< instagram KGOwQOCoB_ >}}\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1335904334000,"created_at":1335904334000,"updated_at":1335904334000},{"title":"VMware and NTFS storage for vmdk","slug":"2012-05-02-vmware-and-ntfs-storage-for-k.md","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"I face the problem of having vmware disks files (vmdk) on ntfs partition (for sharing them between windows and linux installations).\\n\\nWhen I run vmware with this configuration in linux I get an hight CPU usage by _ntfs.mount_ process. Many blogs says that adding _mainMem.useNamedFile=FALSE_ to virtual machine configuration file will fix this issue.\\n\\nThis probably worked only with older vmware versions.\\n\\nThen I found [this](http://www.ajopaul.com/2011/07/22/ubuntu-vmware-and-mount-ntfs-high-cpu-usage-fix/).\\n\\n![](https://codeandrun.it/content/images/import/screenshot.png)\\n\\nIt says to change the location for snapshot and suspend files to a non ntfs partition. This just works!!\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1335977363000,"created_at":1335977363000,"updated_at":1335977363000},{"title":"'Arcumeggia #b'","slug":"2012-05-10-arcumeggia-b","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"{{< instagram  Kc80qDCoCk >}}\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1336666661000,"created_at":1336666661000,"updated_at":1336666661000},{"title":"Cuvignone e Crocetta","slug":"2012-05-29-cuvignone-e-crocetta","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"Giro serale con salita fino al monte Crocetta. La strada, asfaltata fino a poco prima del passo Cuvignone, prosegue su uno sterrato pedalabile spianato da poco. Alcuni tratti sono sabbiosi e un po' faticosi ma si arriva senza difficoltà al bivio dove, svoltando a destra, si prosegue per il Crocione.\\n\\nQuesto tratto non è particolarmente bello e va fatto per la maggior parte con bici in spalla; ma ne vale la pena!!\\n\\n[gallery columns=\\\"4\\\"]\\n\\nIl tracciato GPS non é accurato perché il fido Forerunner si é scaricato e ho dovuto utilizzare l'iPhone che non brilla in quanto ad _accuracy_.\\n\\n## [Cuvignone Crocione](http://connect.garmin.com/activity/183448581 \\\"Cuvignone, crocione\\\")\\n\\nVía [Garmin Connect – alexmufatti](http://connect.garmin.com/explore?owner=alexmufatti)\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1338319691000,"created_at":1338319691000,"updated_at":1338319691000},{"title":"'Monte crocetta #b'","slug":"2012-05-29-monte-crocetta-b","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"{{< instagram LOIN-kCoOR >}}\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1338316633000,"created_at":1338316633000,"updated_at":1338316633000},{"title":"'Nvidia: chrome slow tab switching on linux'","slug":"2012-05-30-nvidia-chrome-slow-tab-switching-on-linux","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"To correct Nvidia problem causing slow tab switching in Chrome:\\n```bash\\nnvidia-settings -a InitialPixmapPlacement=0\\n```\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1338377967000,"created_at":1338377967000,"updated_at":1338377967000},{"title":"IP Address in bash script","slug":"2012-06-06-ip-address-in-bash-script","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"In linux you can get all of yours inferfaces IP with something like this:\\n\\n```bash\\nsudo ifconfig  | grep 'inet addr:'| awk -F: '{ print $2}' | awk '{ print $1 }'\\n```\\n\\nFor example on my machine this command will output:\\n<pre>192.168.247.101\\n127.0.0.1\\n192.168.123.1\\n172.16.209.1</pre>\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1338991084000,"created_at":1338991084000,"updated_at":1338991084000},{"title":"'Monteggia #b'","slug":"2012-06-06-monteggia-b","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"{{< instagram LijrnECoC8 >}}\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1339002777000,"created_at":1339002777000,"updated_at":1339002777000},{"title":"'Cademario #b'","slug":"2012-06-25-cademario-b","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"{{< instagram MT6fZ_ioEb >}}\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1340658244000,"created_at":1340658244000,"updated_at":1340658244000},{"title":"'Gigliola #b'","slug":"2012-08-13-gigliola-b","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"{{< instagram ORsDaiCoKW >}}\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1344878424000,"created_at":1344878424000,"updated_at":1344878424000},{"title":"Vararo - Monteggia","slug":"2012-08-17-vararo-monteggia-2","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"Ripresa delle attività ciclistiche dopo una pausa _forzata_ a cusa di lavoro e vacanze.\\n\\n<!--more-->Giro tipico a Vararo con discesa a Monteggia. Salita un po' in tensione a causa della notizia di quialche mese fa di alcuni ladri di biciclette che si appostavano lungo la salita per derubare i ciclisti armati di bastoni: saranno in vacanza anche loro perché lungo la strada non incontro nessuno!\\n\\n[gallery columns=\\\"4\\\"]\\n\\n## [Vararo - Monteggia](http://connect.garmin.com/activity/210162264)\\n\\nVía [Garmin Connect - alexmufatti](http://connect.garmin.com/explore?owner=alexmufatti)\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1345217163000,"created_at":1345217163000,"updated_at":1345217163000},{"title":"'Traversata Angera-Arona #b'","slug":"2012-09-03-traversata-angera-arona-b","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"{{< instagram PIE17VCoMX >}}\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1346703304000,"created_at":1346703304000,"updated_at":1346703304000},{"title":"Graphical Web 2012","slug":"2012-09-18-graphical-web-2012","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"![](https://codeandrun.it/content/images/import/onlybutton.png)\\n\\nHere are my slides from the [Graphical Web 2012](http://www.graphicalweb.org \\\"Graphical Web 2012\\\") conference in Zürich. Enjoy them!! ;-)\\n\\n[slideshare id=14330562&amp;doc=graphicalweb2012webgl-120918073028-phpapp01]\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1347974478000,"created_at":1347974478000,"updated_at":1347974478000},{"title":"'Che vista! #pizzoni #b'","slug":"2012-12-02-che-vista-pizzoni-b","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"{{< instagram Su5ocfioCJ >}}\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1354448486000,"created_at":1354448486000,"updated_at":1354448486000},{"title":"Gotthard","slug":"2013-07-31-gotthard","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"{{< instagram cUfW27CoLr >}}\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1375282033000,"created_at":1375282033000,"updated_at":1375282033000},{"title":"Crocione","slug":"2013-08-01-crocione","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"{{< instagram ccIV4FCoGH >}}\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1375367783000,"created_at":1375367783000,"updated_at":1375367783000},{"title":"My new wallpaper","slug":"2013-08-16-my-new-wallpaper","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"Here is my new desktop wallpaper (and current blog header), one of the best shot I've taken during my MTB trips.\\n\\n![](https://codeandrun.it/content/images/import/20130704_195307.jpg) Wallpaper Crocione!\\n\\nIt was taken [here](https://www.google.it/maps/preview#!data=!1m4!1m3!1d3265!2d8.6702513!3d45.9207276!2m1!1e3&amp;fid=7) on Cuvignone pass and, on the background, you can see (from left to right): lake Varese, lake Monate and lake Maggiore.\\n\\nI think it's worth a visit!\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1376668062000,"created_at":1376668062000,"updated_at":1376668062000},{"title":"vmware crash on startup after curl update","slug":"2013-08-20-vmware-crash-on-startup-after-curl-update","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"/usr/bin/vmplayer-original 2013-01-30 22:06:11.253190017 +0100\\n+++ /usr/bin/vmplayer 2013-02-09 20:38:33.488125792 +0100\\n@@ -93,6 +93,7 @@\\n\\nif \\\"$BINDIR\\\"/vmware-modconfig --appname=\\\"VMware Player\\\" --icon=\\\"vmware-player\\\" &amp;&amp;\\n/sbin/modinfo vmmon; then\\n+ export LD_LIBRARY_PATH=/usr/lib/vmware/lib/libcurl.so.4\\nexec \\\"$libdir\\\"/bin/\\\"vmplayer\\\" \\\"$@\\\"\\nfi\\n```\\n\\n\\nI decided to apply the patches so that I can update the whole system.\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1377009783000,"created_at":1377009783000,"updated_at":1377009783000},{"title":"Opml to Html converter","slug":"2013-08-21-opml-to-html-converter","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"Yesterday I discovered that wordpress does not have a blogroll feature any more so I looked around to find a way to show my feedly subscription list in my blog.\\n\\nI didn't find anything interesting so decided to implement a simple javascipt class to convert the _opml_ file exported from feedly to an _html_ page so that I could easily create a wordpress page or widget.\\n\\n![](https://codeandrun.it/content/images/import/ompl-html.png?w=300)\\n\\nThe script is really very simple, it takes the ompl, deserialize it and create a corresponding HTML string using from a basic template defined in the JS itself. It can be certainly improved (for example adding some css class to the template for graphical customization) but, for now, it just work for my needs.\\n\\nIn this version you can customize the export style editing the first lines of the JS:\\n```js\\nthis.export_template = '&lt;html&gt;&lt;title&gt;Opml export&lt;/title&gt;&lt;body&gt;{INNERHTML}&lt;/body&gt;&lt;/html&gt;';\\n\\nthis.html_template = '&lt;h1&gt;{OPMLTITLE}&lt;/h1&gt;n&lt;ul&gt;{ITEMS}&lt;/ul&gt;';\\n\\nthis.rss_template = '&lt;li&gt;[&lt;a href=\\\"{XMLURL}\\\"&gt;RSS&lt;/a&gt;] &lt;a href=\\\"{HTMLURL}\\\"&gt;{TITLE}&lt;/a&gt;&lt;/li&gt;n';\\n\\nthis.folder_template_start = '&lt;li&gt;{TITLE}n&lt;ul&gt;n';\\n\\nthis.folder_template_end = '&lt;/ul&gt;&lt;/li&gt;n';\\n```\\nThese variables describe the export format:\\n\\n*   **export_template** is the template for the export html page;\\n*   **html_template** is the template for the page content;\\n*   **rss_template** is the template for each RSS line;\\n*   **folder_template_start** is the template for the opening tag of RSS folder line;\\n*   **folder_template_end** is the template for the closing tag of RSS folder line.\\n\\nYou can find it on ghitub, under my script repository: [opml.js](https://github.com/alexmufatti/Scripts/blob/master/scripts/opml.js \\\"opml.js\\\") and [opml.html](https://github.com/alexmufatti/Scripts/blob/master/scripts/opml.html \\\"opml.html\\\").\\n\\nI hope it can be useful.\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1377064814000,"created_at":1377064814000,"updated_at":1377064814000},{"title":"'Silverlight: detecting design mode'","slug":"2013-08-29-silverlight-detecting-design-mode","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"Just a quick tip useful when you have to do something special for Silverlight designer to work correctly.\\n```csharp\\nbool _inInDesignMode = DesignerProperties.IsInDesignTool;\\n```\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1377794171000,"created_at":1377794171000,"updated_at":1377794171000},{"title":"Xfce loses theme settings","slug":"2013-10-10-xfce-loses-theme-settings","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"![](https://codeandrun.it/content/images/import/xfce-logo.jpg)Today I started my xfce desktop and it looks like ...\\\"different\\\". No theme loaded, default icons, no background. I tried to change theme from Xfce Settings but nothing, it doesn't work.\\n\\nMy .session-errors reveals a\\n<pre>The program 'xfsettingsd' received an X Window System error.</pre>\\nAfter a bit o googling it seems to be an [aged bug](https://bugzilla.redhat.com/show_bug.cgi?id=867455) of xfce when used on multiple monitor configuration.\\n\\nThe [solution](http://suluke.blogspot.it/2013/07/xfce-suddenly-not-applying-any-themes.html), or better, the workaround is to delete the file:\\n<pre>\\n    .config/xfce4/xfconf/xfce-perchannel-xml/displays.xml\\n</pre>\\nNow you can log out and log in again in your themed Xfce :-)\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1381428119000,"created_at":1381428119000,"updated_at":1381428119000},{"title":"Calling JS class methods from Silverlight application","slug":"2013-12-19-calling-js-class-methods-silverlight","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"I'm working on a project in which we have to call some JS method of the containing page from a Silverlight application.\\n\\nIt seems to be really straight forward like:\\n\\n```csharp\\nHtmlPage.Window.Invoke(\\\"GlobalJsMethod\\\",param1,param2);\\n```\\n\\nBut this works only for global methods and not for JS class methods.\\n\\n<!--more-->\\n\\nIn fact this will not work:\\n<pre class=\\\"lang:csharp decode:true\\\">HtmlPage.Window.Invoke(\\\"JsClassInstance.JsMethod\\\",param1,param2);</pre>\\nYou can make a global wrapper for every class methods but you can also do something like this:\\n\\n```csharp\\nprivate ScriptObject _jsObject = HtmlPage.Window.Eval(\\\"JsClassInstance\\\") as ScriptObject;\\nprivate void UserControl_Loaded(object sender, RoutedEventArgs e)\\n        {\\n                _jsObject.Invoke(\\\"JsMethod\\\",param1,param2);\\n        }\\n```\\n\\nthat is far more elegant.\\n\\nThis is only a quick tip. Maybe I'll write a more detailed post an JS-Silverlight interaction in the future.\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1387480685000,"created_at":1387480685000,"updated_at":1387480685000},{"title":"Cinnamon screenshot applet default folder","slug":"2013-12-20-cinnamon-screenshot-applet-default-folder","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"I've switched some weeks ago to Linux Mint and Cinnamon from Xfce and in these days I'm a kind of exploring the new desktop.\\n\\nI'm used to take screenshot for work, totake some notes and so I installed the [Cinnamon screenshot applet](http://cinnamon-spices.linuxmint.com/applets/view/35 \\\"screenshot applet\\\").\\n\\n![](https://codeandrun.it/content/images/import/screenshot-from-2013-12-20-195253.png)\\n\\n\\nAfter some day using it I was a bit bored by the screenshots saved in Pictures folder by default so I traied to change this behaviur.\\n\\nLooking into the applet js file i discover that the applet is based on gnome-screenshot and so I find an easy solution to my problem.\\n\\nYou can edit the with dconf-editor the configuration string\\n\\n`org.gnome.screenshot.auto-save-directory `\\n\\n![](https://codeandrun.it/content/images/import/screenshot-from-2013-12-20-195128.png?w=300)\\n\\nad set you favorite screenshot folder!\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1387569290000,"created_at":1387569290000,"updated_at":1387569290000},{"title":"BTW, I installed arch... e vivo felice","slug":"2020-06-18-btw-i-installed-arch","feature_image":"","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"BTW, I instaaled arch\\n\\npartizione di scorta\\n\\nprogrammi\\n\\ncomplessita\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1592511413000,"created_at":1592511413000,"updated_at":1592511413000},{"title":"\"VMware: Microfono rumoroso in Windows 10 host\"","slug":"2020-08-10-vmware_microfono_rumoroso_in_windows_10_host","feature_image":"https://codeandrun.it/content/images/import/mic.jpg","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"![](https://codeandrun.it/content/images/import/mic.jpg)\\n\\nUtilizzando Linux come sistema operativo di base a volte capita di dover avviare delle macchine virtuali Windows per eseguire quei programmi che su linux non esistono o hanno funzionalità limitate.\\nEsempi tipici sono *Skype for Business* che non esiste in linux o *Teams* che non ha tutte le funzionalità della versione nativa.\\n\\nPurtroppo però l'audio del microfono all'interno della VM a volte risulta estremamente disturbato, tanto da essere inutilizzabile.\\n\\nDopo un po' di prove e molte ricerche ho trovato un modo, assolutamente contro-intuitivo, per sistemare questo problema.\\n\\nPer prima cosa installate i VmWareTools se non lo avete ancora fatto e assicuratevi che nella macchina virtuale sia configurata una scheda audio in modalità `auto detect`.\\n\\n![](https://codeandrun.it/content/images/import/setup.jpg)\\n\\nA questo punto spegnete la macchina virtuale ed editate il corrispettivo file `.vmx`.\\n\\nCercate la riga contenente `sound.virtualDev = \\\"hdaudio\\\"` e rimuovetela. Sì, questo è il passaggio contro-intuitivo: rimuovendo quella riga si eviterà che VmWare simuli una scheda audio virtuale e utilizzi invece quella presente sulla vostra macchina.\\n\\nAl riavvio della macchina virtuale noterete che non viene rilevato nessun hardware per la riproduzione audio. \\nOra montate il cd dei vmware tools come se voleste reinstallarli (potete anche usare la voce del menu di vmware) ma non fatelo. Aprite un _prompt_ e andate sul device che contiene l'installer. Da qui lanciate il comando `setup64.exe /a`. L'opzione `a` fará in modo che i vmware tools, al posto di essere installati, siano solo scompattati una cartella di vostra scelta. Scegliete una cartella e continuate.\\n\\nOra aprite il `Device Manager`; troverete una periferica multimediale non riconosciuta. Scegliete di aggiornare il driver e, invece di farlo cercare automaticamente dal sistema operativo, scegliete di indicare voi dove trovarlo. \\n\\n![](https://codeandrun.it/content/images/import/browse.jpg)\\n\\nCome percorso scegliete quello dove avete scompattato i vmware Tools e poi navigate nelle sotto cartelle `vmware/drivers/audio/vista`.\\n\\n![](https://codeandrun.it/content/images/import/folders.jpg)\\n\\nVerrà quindi installato il driver corretto e da quel momento non dovreste avere più problemi di disturbi nell'uso del microfono all'interno di Windows 10 in vmware!\\n\\n![](https://codeandrun.it/content/images/import/done.jpg)\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1597046400000,"created_at":1597046400000,"updated_at":1597046400000},{"title":"\"My year in sport\"","slug":"2021-01-02-yaer-in-sport","feature_image":"https://codeandrun.it/content/images/import/days.jpg","mobiledoc":"{\"version\":\"0.3.1\",\"markups\":[],\"atoms\":[],\"cards\":[[\"markdown\",{\"cardName\":\"markdown\",\"markdown\":\"![](https://codeandrun.it/content/images/import/days.jpg)\\n\\nDa qualche giorno è uscito il riassunto annuale di Strava.\\n\\n\\nNon male per essere stato un anno _complicato_. Tra lockdown e nuova arrivata non sempre ho potuto correre.\\n\\n![](https://codeandrun.it/content/images/import/kms.jpg)\\n\\nSicuramente meno chilometri degli ultimi anno ma con un passo medio superiore. Per l'anno prossimo l'obiettivo sarà ritornare sopra i 2000km!\\n\\nDurante la preparazione per la maratona di milano, poi annullata, ho fatto anche un paio di lunghissimi che sono state le uscite più lunghe dell'anno.\\n\\n![](https://codeandrun.it/content/images/import/passo.jpg)\\n\\nUna bella soddisfazione è stata anche raggiungere quasi i 1000mt di dislivello positivo in un'unica uscita!\\n\\n![](https://codeandrun.it/content/images/import/dislivello_max.jpg)\\n\\n![](https://codeandrun.it/content/images/import/dislivello_tot.jpg)\\n\\nEd ora vediamo cosa ci riserva il 2021!\"}]],\"sections\":[[10,0]]}","status":"published","published_at":1609578000000,"created_at":1609578000000,"updated_at":1609578000000}]}}
